apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_flash.h
/****************************************************************************
 * arch/arm/src/stm32h5/hardware/stm32h5xxx_flash.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_FLASH_H
#define __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_FLASH_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_FLASH_ACR_OFFSET           0x0000
#define STM32_FLASH_NSKEYR_OFFSET        0x0004
#define STM32_FLASH_SECKEYR_OFFSET       0x0008
#define STM32_FLASH_OPTKEYR_OFFSET       0x000c
#define STM32_FLASH_NSOBKKEYR_OFFSET     0x0010
#define STM32_FLASH_SECOBKKEYR_OFFSET    0x0014
#define STM32_FLASH_OPSR_OFFSET          0x0018
#define STM32_FLASH_OPTCR_OFFSET         0x001c
#define STM32_FLASH_NSSR_OFFSET          0x0020
#define STM32_FLASH_SECSR_OFFSET         0x0024
#define STM32_FLASH_NSCR_OFFSET          0x0028
#define STM32_FLASH_SECCR_OFFSET         0x002c
#define STM32_FLASH_NSCCR_OFFSET         0x0030
#define STM32_FLASH_SECCCR_OFFSET        0x0034
#define STM32_FLASH_PRIVCFGR_OFFSET      0x003c
#define STM32_FLASH_NSOBKCFGR_OFFSET     0x0040
#define STM32_FLASH_SECOBKCFGR_OFFSET    0x0044
#define STM32_FLASH_HDPEXTR_OFFSET       0x0048
#define STM32_FLASH_OPTSR_CUR_OFFSET     0x0050
#define STM32_FLASH_OPTSR_PRG_OFFSET     0x0054
#define STM32_FLASH_NSEPOCHR_CUR_OFFSET  0x0060
#define STM32_FLASH_NSEPOCHR_PRG_OFFSET  0x0064
#define STM32_FLASH_SECEPOCHR_CUR_OFFSET 0x0068
#define STM32_FLASH_SECEPOCHR_PRG_OFFSET 0x006c
#define STM32_FLASH_OPTSR2_CUR_OFFSET    0x0070
#define STM32_FLASH_OPTSR2_PRG_OFFSET    0x0074
#define STM32_FLASH_NSBOOTR_CUR_OFFSET   0x0080
#define STM32_FLASH_NSBOOTR_PRG_OFFSET   0x0084
#define STM32_FLASH_SECBOOTR_CUR_OFFSET  0x0088
#define STM32_FLASH_SECBOOTR_PRG_OFFSET  0x008c
#define STM32_FLASH_OTBPBLR_CUR_OFFSET   0x0090
#define STM32_FLASH_OTBPBLR_PRG_OFFSET   0x0094
#define STM32_FLASH_SECBB1R_1_OFFSET     0x00a0
#define STM32_FLASH_SECBB1R_2_OFFSET     0x00a4
#define STM32_FLASH_SECBB1R_3_OFFSET     0x00a8
#define STM32_FLASH_SECBB1R_4_OFFSET     0x00ac
#define STM32_FLASH_PRIVBB1R_1_OFFSET    0x00c0
#define STM32_FLASH_PRIVBB1R_2_OFFSET    0x00c4
#define STM32_FLASH_PRIVBB1R_3_OFFSET    0x00c8
#define STM32_FLASH_PRIVBB1R_4_OFFSET    0x00cc
#define STM32_FLASH_SECWM1R_CUR_OFFSET   0x00e0
#define STM32_FLASH_SECWM1R_PRG_OFFSET   0x00e4
#define STM32_FLASH_WRP1R_CUR_OFFSET     0x00e8
#define STM32_FLASH_WRP1R_PRG_OFFSET     0x00ec
#define STM32_FLASH_EDATA1R_CUR_OFFSET   0x00f0
#define STM32_FLASH_EDATA1R_PRG_OFFSET   0x00f4
#define STM32_FLASH_HDP1R_CUR_OFFSET     0x00f8
#define STM32_FLASH_HDP1R_PRG_OFFSET     0x00fc
#define STM32_FLASH_ECCCORR_OFFSET       0x0100
#define STM32_FLASH_ECCDETR_OFFSET       0x0104
#define STM32_FLASH_ECCDR_OFFSET         0x0108
#define STM32_FLASH_SECBB2R_1_OFFSET     0x01a0
#define STM32_FLASH_SECBB2R_2_OFFSET     0x01a4
#define STM32_FLASH_SECBB2R_3_OFFSET     0x01a8
#define STM32_FLASH_SECBB2R_4_OFFSET     0x01ac
#define STM32_FLASH_PRIVBB2R_1_OFFSET    0x01c0
#define STM32_FLASH_PRIVBB2R_2_OFFSET    0x01c4
#define STM32_FLASH_PRIVBB2R_3_OFFSET    0x01c8
#define STM32_FLASH_PRIVBB2R_4_OFFSET    0x01cc
#define STM32_FLASH_SECWM2R_CUR_OFFSET   0x01e0
#define STM32_FLASH_SECWM2R_PRG_OFFSET   0x01e4
#define STM32_FLASH_WRP2R_CUR_OFFSET     0x01e8
#define STM32_FLASH_WRP2R_PRG_OFFSET     0x01ec
#define STM32_FLASH_EDATA2R_CUR_OFFSET   0x01f0
#define STM32_FLASH_EDATA2R_PRG_OFFSET   0x01f4
#define STM32_FLASH_HDP2R_CUR_OFFSET     0x01f8
#define STM32_FLASH_HDP2R_PRG_OFFSET     0x01fc

/* Register Addresses *******************************************************/

#define STM32_FLASH_ACR           (STM32_FLASHIF_BASE + STM32_FLASH_ACR_OFFSET)
#define STM32_FLASH_NSKEYR        (STM32_FLASHIF_BASE + STM32_FLASH_NSKEYR_OFFSET)
#define STM32_FLASH_SECKEYR       (STM32_FLASHIF_BASE + STM32_FLASH_SECKEYR_OFFSET)
#define STM32_FLASH_OPTKEYR       (STM32_FLASHIF_BASE + STM32_FLASH_OPTKEYR_OFFSET)
#define STM32_FLASH_NSOBKKEYR     (STM32_FLASHIF_BASE + STM32_FLASH_NSOBKKEYR_OFFSET)
#define STM32_FLASH_SECOBKKEYR    (STM32_FLASHIF_BASE + STM32_FLASH_SECOBKKEYR_OFFSET)
#define STM32_FLASH_OPSR          (STM32_FLASHIF_BASE + STM32_FLASH_OPSR_OFFSET)
#define STM32_FLASH_OPTCR         (STM32_FLASHIF_BASE + STM32_FLASH_OPTCR_OFFSET)
#define STM32_FLASH_NSSR          (STM32_FLASHIF_BASE + STM32_FLASH_NSSR_OFFSET)
#define STM32_FLASH_SECSR         (STM32_FLASHIF_BASE + STM32_FLASH_SECSR_OFFSET)
#define STM32_FLASH_NSCR          (STM32_FLASHIF_BASE + STM32_FLASH_NSCR_OFFSET)
#define STM32_FLASH_SECCR         (STM32_FLASHIF_BASE + STM32_FLASH_SECCR_OFFSET)
#define STM32_FLASH_NSCCR         (STM32_FLASHIF_BASE + STM32_FLASH_NSCCR_OFFSET)
#define STM32_FLASH_SECCCR        (STM32_FLASHIF_BASE + STM32_FLASH_SECCCR_OFFSET)
#define STM32_FLASH_PRIVCFGR      (STM32_FLASHIF_BASE + STM32_FLASH_PRIVCFGR_OFFSET)
#define STM32_FLASH_NSOBKCFGR     (STM32_FLASHIF_BASE + STM32_FLASH_NSOBKCFGR_OFFSET)
#define STM32_FLASH_SECOBKCFGR    (STM32_FLASHIF_BASE + STM32_FLASH_SECOBKCFGR_OFFSET)
#define STM32_FLASH_HDPEXTR       (STM32_FLASHIF_BASE + STM32_FLASH_HDPEXTR_OFFSET)
#define STM32_FLASH_OPTSR_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR_CUR_OFFSET)
#define STM32_FLASH_OPTSR_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR_PRG_OFFSET)
#define STM32_FLASH_NSEPOCHR_CUR  (STM32_FLASHIF_BASE + STM32_FLASH_NSEPOCHR_CUR_OFFSET)
#define STM32_FLASH_NSEPOCHR_PRG  (STM32_FLASHIF_BASE + STM32_FLASH_NSEPOCHR_PRG_OFFSET)
#define STM32_FLASH_SECEPOCHR_CUR (STM32_FLASHIF_BASE + STM32_FLASH_SECEPOCHR_CUR_OFFSET)
#define STM32_FLASH_SECEPOCHR_PRG (STM32_FLASHIF_BASE + STM32_FLASH_SECEPOCHR_PRG_OFFSET)
#define STM32_FLASH_OPTSR2_CUR    (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR2_CUR_OFFSET)
#define STM32_FLASH_OPTSR2_PRG    (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR2_PRG_OFFSET)
#define STM32_FLASH_NSBOOTR_CUR   (STM32_FLASHIF_BASE + STM32_FLASH_NSBOOTR_CUR_OFFSET)
#define STM32_FLASH_NSBOOTR_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_NSBOOTR_PRG_OFFSET)
#define STM32_FLASH_SECBOOTR_CUR  (STM32_FLASHIF_BASE + STM32_FLASH_SECBOOTR_CUR_OFFSET)
#define STM32_FLASH_SECBOOTR_PRG  (STM32_FLASHIF_BASE + STM32_FLASH_SECBOOTR_PRG_OFFSET)
#define STM32_FLASH_OTBPBLR_CUR   (STM32_FLASHIF_BASE + STM32_FLASH_OTBPBLR_CUR_OFFSET)
#define STM32_FLASH_OTBPBLR_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_OTBPBLR_PRG_OFFSET)
#define STM32_FLASH_SECBB1R_1     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R_1_OFFSET)
#define STM32_FLASH_SECBB1R_2     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R_2_OFFSET)
#define STM32_FLASH_SECBB1R_3     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R_3_OFFSET)
#define STM32_FLASH_SECBB1R_4     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R_4_OFFSET)
#define STM32_FLASH_PRIVBB1R_1    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R_1_OFFSET)
#define STM32_FLASH_PRIVBB1R_2    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R_2_OFFSET)
#define STM32_FLASH_PRIVBB1R_3    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R_3_OFFSET)
#define STM32_FLASH_PRIVBB1R_4    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R_4_OFFSET)
#define STM32_FLASH_SECWM1R_CUR   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM1R_CUR_OFFSET)
#define STM32_FLASH_SECWM1R_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM1R_PRG_OFFSET)
#define STM32_FLASH_WRP1R_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_WRP1R_CUR_OFFSET)
#define STM32_FLASH_WRP1R_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_WRP1R_PRG_OFFSET)
#define STM32_FLASH_EDATA1R_CUR   (STM32_FLASHIF_BASE + STM32_FLASH_EDATA1R_CUR_OFFSET)
#define STM32_FLASH_EDATA1R_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_EDATA1R_PRG_OFFSET)
#define STM32_FLASH_HDP1R_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_HDP1R_CUR_OFFSET)
#define STM32_FLASH_HDP1R_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_HDP1R_PRG_OFFSET)
#define STM32_FLASH_ECCCORR       (STM32_FLASHIF_BASE + STM32_FLASH_ECCCORR_OFFSET)
#define STM32_FLASH_ECCDETR       (STM32_FLASHIF_BASE + STM32_FLASH_ECCDETR_OFFSET)
#define STM32_FLASH_ECCDR         (STM32_FLASHIF_BASE + STM32_FLASH_ECCDR_OFFSET)
#define STM32_FLASH_SECBB2R_1     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R_1_OFFSET)
#define STM32_FLASH_SECBB2R_2     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R_2_OFFSET)
#define STM32_FLASH_SECBB2R_3     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R_3_OFFSET)
#define STM32_FLASH_SECBB2R_4     (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R_4_OFFSET)
#define STM32_FLASH_PRIVBB2R_1    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R_1_OFFSET)
#define STM32_FLASH_PRIVBB2R_2    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R_2_OFFSET)
#define STM32_FLASH_PRIVBB2R_3    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R_3_OFFSET)
#define STM32_FLASH_PRIVBB2R_4    (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R_4_OFFSET)
#define STM32_FLASH_SECWM2R_CUR   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM2R_CUR_OFFSET)
#define STM32_FLASH_SECWM2R_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM2R_PRG_OFFSET)
#define STM32_FLASH_WRP2R_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_WRP2R_CUR_OFFSET)
#define STM32_FLASH_WRP2R_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_WRP2R_PRG_OFFSET)
#define STM32_FLASH_EDATA2R_CUR   (STM32_FLASHIF_BASE + STM32_FLASH_EDATA2R_CUR_OFFSET)
#define STM32_FLASH_EDATA2R_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_EDATA2R_PRG_OFFSET)
#define STM32_FLASH_HDP2R_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_HDP2R_CUR_OFFSET)
#define STM32_FLASH_HDP2R_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_HDP2R_PRG_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Flash Access Control Register (ACR) */

#define FLASH_ACR_LATENCY_SHIFT   (0)
#define FLASH_ACR_LATENCY_MASK    (0xF << FLASH_ACR_LATENCY_SHIFT)
#  define FLASH_ACR_LATENCY(n)    ((n) << FLASH_ACR_LATENCY_SHIFT)  /* n wait states, for Vcore range 0-3. */

#define FLASH_ACR_WRHIGHFREQ_SHIFT (4)
#define FLASH_ACR_WRHIGHFREQ_MASK  (0x3 << FLASH_ACR_WRHIGHFREQ_SHIFT)
#  define FLASH_ACR_WRHIGHFREQ(n)  ((n) << FLASH_ACR_WRHIGHFREQ_SHIFT)  /* Used to control the delay between NVM
                                                                         * signals during programming operations
                                                                         */
#define FLASH_ACR_PRFTEN           (1 << 8)                             /* Bit 8: Prefetch Enable */

/* Flash Operation Status Register (OPSR) */

#define FLASH_OPSR_ADDR_OP_SHIFT   (0)
#define FLASH_OPSR_ADDR_OP_MASK    (0xfffff << FLASH_OPSR_ADDR_OP_SHIFT)

#define FLASH_OPSR_DATA_OP         (1 << 21)
#define FLASH_OPSR_BK_OP           (1 << 22)
#define FLASH_OPSR_SYSF_OP         (1 << 23)
#define FLASH_OPSR_OTP_OP          (1 << 24)

#define FLASH_OPSR_CODE_OP_SHIFT    (29)
#define FLASH_OPSR_CODE_OP_MASK     (0x7 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_NO_FLSH  (0 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_SNGL_WRT (1 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_OBK_ALT  (2 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_SEC_ERS  (3 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_BNK_ERS  (4 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_MASS_ERS (5 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_OPT_CNG  (6 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_OBK_SWP  (7 << FLASH_OPSR_CODE_OP_SHIFT)

/* Flash Option Control Register (OPTCR) */

#define FLASH_OPTCR_OPTLOCK        (1 << 0)
#define FLASH_OPTCR_OPTSTRT        (1 << 1)
#define FLASH_OPTCR_SWAP_BANK      (1 << 31)

