apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_flash.h
/* Flash Non-Secure Status Register (NSSR) */

#define FLASH_NSSR_BSY             (1 << 0)
#define FLASH_NSSR_WBNE            (1 << 1)
#define FLASH_NSSR_DBNE            (1 << 3)
#define FLASH_NSSR_EOP             (1 << 16)
#define FLASH_NSSR_WRPERR          (1 << 17)
#define FLASH_NSSR_PGSERR          (1 << 18)
#define FLASH_NSSR_STRBERR         (1 << 19)
#define FLASH_NSSR_INCERR          (1 << 20)
#define FLASH_NSSR_OBKERR          (1 << 21)
#define FLASH_NSSR_OBKWERR         (1 << 22)
#define FLASH_NSSR_OPTCHANGERR     (1 << 23)

/* Flash Secure Status Register (SECSR) */

#define FLASH_NSSR_BSY             (1 << 0)
#define FLASH_NSSR_WBNE            (1 << 1)
#define FLASH_NSSR_DBNE            (1 << 3)
#define FLASH_NSSR_EOP             (1 << 16)
#define FLASH_NSSR_WRPERR          (1 << 17)
#define FLASH_NSSR_PGSERR          (1 << 18)
#define FLASH_NSSR_STRBERR         (1 << 19)
#define FLASH_NSSR_INCERR          (1 << 20)
#define FLASH_NSSR_OBKERR          (1 << 21)
#define FLASH_NSSR_OBKWERR         (1 << 22)

/* Flash Non-Secure Control Register (NSCR) */

#define FLASH_NSCR_LOCK            (1 << 0)
#define FLASH_NSCR_PG              (1 << 1)
#define FLASH_NSCR_SER             (1 << 2)
#define FLASH_NSCR_BER             (1 << 3)
#define FLASH_NSCR_FW              (1 << 4)
#define FLASH_NSCR_STRT            (1 << 5)

#define FLASH_NSCR_SNB_SHIFT       (6)
#define FLASH_NSCR_SNB_MASK        (0x7f << FLASH_NSCR_SNB_SHIFT)
#  define FLASH_NSCR_SNB(n)        ((n) << FLASH_NSCR_SNB_SHIFT)

#define FLASH_NSCR_MER             (1 << 15)
#define FLASH_NSCR_EOPIE           (1 << 16)
#define FLASH_NSCR_WRPERRIE        (1 << 17)
#define FLASH_NSCR_PGSERRIE        (1 << 18)
#define FLASH_NSCR_STRBERRIE       (1 << 19)
#define FLASH_NSCR_INCERRIE        (1 << 20)
#define FLASH_NSCR_OBKERRIE        (1 << 21)
#define FLASH_NSCR_OBKWERRIE       (1 << 22)
#define FLASH_NSCR_OPTCHANGEERRIE  (1 << 23)
#define FLASH_NSCR_BKSEL           (1 << 31)

/* Flash Secure Control Register (NSCR) */

#define FLASH_SECCR_LOCK             (1 << 0)
#define FLASH_SECCR_PG               (1 << 1)
#define FLASH_SECCR_SER              (1 << 2)
#define FLASH_SECCR_BER              (1 << 3)
#define FLASH_SECCR_FW               (1 << 4)
#define FLASH_SECCR_STRT             (1 << 5)

#define FLASH_SECCR_SNB_SHIFT        (6)
#define FLASH_SECCR_SNB_MASK         (0x7f << FLASH_SECCR_SNB_SHIFT)
#  define FLASH_SECCR_SNB(n)         ((n) << FLASH_SECCR_SNB_SHIFT)

#define FLASH_SECCR_MER              (1 << 15)
#define FLASH_SECCR_EOPIE            (1 << 16)
#define FLASH_SECCR_WRPERRIE         (1 << 17)
#define FLASH_SECCR_PGSERRIE         (1 << 18)
#define FLASH_SECCR_STRBERRIE        (1 << 19)
#define FLASH_SECCR_INCERRIE         (1 << 20)
#define FLASH_SECCR_OBKERRIE         (1 << 21)
#define FLASH_SECCR_OBKWERRIE        (1 << 22)
#define FLASH_SECCR_INV              (1 << 29)
#define FLASH_SECCR_BKSEL            (1 << 31)

/* Flash Non-Secure Clear Control Register (NSCCR) */

#define FLASH_NSCCR_CLR_EOP          (1 << 16)
#define FLASH_NSCCR_CLR_WRPERR       (1 << 17)
#define FLASH_NSCCR_CLR_PGSERR       (1 << 18)
#define FLASH_NSCCR_CLR_STRBERR      (1 << 19)
#define FLASH_NSCCR_CLR_INCERR       (1 << 20)
#define FLASH_NSCCR_CLR_OBKERR       (1 << 21)
#define FLASH_NSCCR_CLR_OBKWERR      (1 << 22)
#define FLASH_NSCCR_CLR_OPTCHANGEERR (1 << 23)

/* Flash Secure Clear Control Register (SECCCR) */

#define FLASH_SECCCR_CLR_EOP         (1 << 16)
#define FLASH_SECCCR_CLR_WRPERR      (1 << 17)
#define FLASH_SECCCR_CLR_PGSERR      (1 << 18)
#define FLASH_SECCCR_CLR_STRBERR     (1 << 19)
#define FLASH_SECCCR_CLR_INCERR      (1 << 20)
#define FLASH_SECCCR_CLR_OBKERR      (1 << 21)
#define FLASH_SECCCR_CLR_OBKWERR     (1 << 22)

/* Flash Privilege Configuration Register (PRIVCFGR) */

#define FLASH_PRIVCFGR_SPRIV         (1 << 0)
#define FLASH_PRIVCFGR_NSPRIV        (1 << 1)

/* Flash Non-Secure OBK Configuration Register (NSOBKCFGR) */

#define FLASH_NSOBKCFGR_LOCK           (1 << 0)
#define FLASH_NSOBKCFGR_SWAP_SECT_REQ  (1 << 1)
#define FLASH_NSOBKCFGR_ALT_SECT       (1 << 2)
#define FLASH_NSOBKCFGR_ALT_SECT_ERASE (1 << 3)

#define FLASH_NSOBKCFGR_SWAP_OFFSET_SHIFT (16)
#define FLASH_NSOBKCFGR_SWAP_OFFSET_MASK  (0x1ff << FLASH_NSOBKCFGR_SWAP_OFFSET_SHIFT)

/* Flash Non-Secure OBK Configuration Register (SECOBKCFGR) */

#define FLASH_SECOBKCFGR_LOCK           (1 << 0)
#define FLASH_SECOBKCFGR_SWAP_SECT_REQ  (1 << 1)
#define FLASH_SECOBKCFGR_ALT_SECT       (1 << 2)
#define FLASH_SECOBKCFGR_ALT_SECT_ERASE (1 << 3)

#define FLASH_SECOBKCFGR_SWAP_OFFSET_SHIFT (16)
#define FLASH_SECOBKCFGR_SWAP_OFFSET_MASK  (0x1ff << FLASH_SECOBKCFGR_SWAP_OFFSET_SHIFT)

/* Flash HDP Extension Register (HDPEXTR) */

#define FLASH_HDPEXTR_HDP1_EXT_SHIFT    (0)
#define FLASH_HDPEXTR_HDP1_EXT_MASK     (0x7f << FLASH_HDPEXTR_HDP1_EXT_SHIFT)
#  define FLASH_HDPEXTR_HDP1_EXT(n)     ((n) << FLASH_HDPEXTR_HDP1_SHIFT)

#define FLASH_HDPEXTR_HDP2_EXT_SHIFT    (0)
#define FLASH_HDPEXTR_HDP2_EXT_MASK     (0x7f << FLASH_HDPEXTR_HDP2_EXT_SHIFT)
#  define FLASH_HDPEXTR_HDP2_EXT(n)     ((n) << FLASH_HDPEXTR_HDP2_SHIFT)

/* Flash Option Status (Current) Register (OPTSR_CUR) */

#define FLASH_OPTSR_CUR_BOR_LEV_SHIFT   (0)
#define FLASH_OPTSR_CUR_BOR_LEV_MASK    (3 << FLASH_OPTSR_CUR_BOR_LEV_SHIFT)
#define FLASH_OPTSR_CUR_BOR_LEV_1       (0 << FLASH_OPTSR_CUR_BOR_LEV_SHIFT)
#define FLASH_OPTSR_CUR_BOR_LEV_2       (1 << FLASH_OPTSR_CUR_BOR_LEV_SHIFT)
#define FLASH_OPTSR_CUR_BOR_LEV_3       (2 << FLASH_OPTSR_CUR_BOR_LEV_SHIFT)

#define FLASH_OPTSR_CUR_BORH_EN         (1 << 2)
#define FLASH_OPTSR_CUR_IWDG_SW         (1 << 3)
#define FLASH_OPTSR_CUR_WWDG_SW         (1 << 4)
#define FLASH_OPTSR_CUR_NRST_STOP       (1 << 6)
#define FLASH_OPTSR_CUR_NRST_STDBY      (1 << 7)

#define FLASH_OPTSR_CUR_PRODUCT_STATE_SHIFT   (8)
#define FLASH_OPTSR_CUR_PRODUCT_STATE_MASK    (0xff << FLASH_OPTSR_CUR_PRODUCT_STATE_SHIFT)

#define FLASH_OPTSR_CUR_IO_VDD_HSLV     (1 << 16)
#define FLASH_OPTSR_CUR_IO_VDDIO2_HSLV  (1 << 17)
#define FLASH_OPTSR_CUR_IWDG_STOP       (1 << 20)
#define FLASH_OPTSR_CUR_IWDG_STDBY      (1 << 21)

