apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_flash.h
#define FLASH_OPTSR_CUR_BOOT_UBE_SHIFT  (22)
#define FLASH_OPTSR_CUR_BOOT_UBE_MASK   (0xff << FLASH_OPTSR_CUR_BOOT_UBE_SHIFT)

#define FLASH_OPTSR_CUR_SWAP_BANK       (1 << 31)

/* Flash Option Status (Program) Register (OPTSR_PRG) */

#define FLASH_OPTSR_PRG_BOR_LEV_SHIFT   (0)
#define FLASH_OPTSR_PRG_BOR_LEV_MASK    (3 << FLASH_OPTSR_PRG_BOR_LEV_SHIFT)
#define FLASH_OPTSR_PRG_BOR_LEV_1       (0 << FLASH_OPTSR_PRG_BOR_LEV_SHIFT)
#define FLASH_OPTSR_PRG_BOR_LEV_2       (1 << FLASH_OPTSR_PRG_BOR_LEV_SHIFT)
#define FLASH_OPTSR_PRG_BOR_LEV_3       (2 << FLASH_OPTSR_PRG_BOR_LEV_SHIFT)

#define FLASH_OPTSR_PRG_BORH_EN         (1 << 2)
#define FLASH_OPTSR_PRG_IWDG_SW         (1 << 3)
#define FLASH_OPTSR_PRG_WWDG_SW         (1 << 4)
#define FLASH_OPTSR_PRG_NRST_STOP       (1 << 6)
#define FLASH_OPTSR_PRG_NRST_STDBY      (1 << 7)

#define FLASH_OPTSR_PRG_PRODUCT_STATE_SHIFT   (8)
#define FLASH_OPTSR_PRG_PRODUCT_STATE_MASK    (0xff << FLASH_OPTSR_PRG_PRODUCT_STATE_SHIFT)

#define FLASH_OPTSR_PRG_IO_VDD_HSLV     (1 << 16)
#define FLASH_OPTSR_PRG_IO_VDDIO2_HSLV  (1 << 17)
#define FLASH_OPTSR_PRG_IWDG_STOP       (1 << 20)
#define FLASH_OPTSR_PRG_IWDG_STDBY      (1 << 21)

#define FLASH_OPTSR_PRG_BOOT_UBE_SHIFT  (22)
#define FLASH_OPTSR_PRG_BOOT_UBE_MASK   (0xff << FLASH_OPTSR_PRG_BOOT_UBE_SHIFT)

#define FLASH_OPTSR_PRG_SWAP_BANK       (1 << 31)

/* Flash Non-Secure EPOCH Register (NSEPOCHR_CUR) */

#define FLASH_NSEPOCHR_CUR_MASK         (0xffffff)

/* Flash Secure EPOCH Register (SECEPOCHR_CUR) */

#define FLASH_SECEPOCHR_CUR_MASK        (0xffffff)

/* Flash Option Status (Current) Register (OPTSR2_CUR) */

#define FLASH_OPTSR2_CUR_SRAM13_RST     (1 << 2)
#define FLASH_OPTSR2_CUR_SRAM2_RST      (1 << 3)
#define FLASH_OPTSR2_CUR_BKPRAM_ECC     (1 << 4)
#define FLASH_OPTSR2_CUR_SRAM3_ECC      (1 << 5)
#define FLASH_OPTSR2_CUR_SRAM2_ECC      (1 << 6)
#define FLASH_OPTSR2_CUR_USBPD_DIS      (1 << 8)

#define FLASH_OPTSR2_CUR_TZEN_SHIFT     (24)
#define FLASH_OPTSR2_CUR_TZEN_MASK      (0xff << FLASH_OPTSR2_CUR_TZEN_SHIFT)
#define FLASH_OPTSR2_CUR_TZEN_EN        (0xb4 << FLASH_OPTSR2_CUR_TZEN_SHIFT)
#define FLASH_OPTSR2_CUR_TZEN_DIS       (0xb4 << FLASH_OPTSR2_CUR_TZEN_SHIFT)

/* Flash Option Status (Program) Register (OPTSR2_PRG) */

#define FLASH_OPTSR2_PRG_SRAM13_RST     (1 << 2)
#define FLASH_OPTSR2_PRG_SRAM2_RST      (1 << 3)
#define FLASH_OPTSR2_PRG_BKPRAM_ECC     (1 << 4)
#define FLASH_OPTSR2_PRG_SRAM3_ECC      (1 << 5)
#define FLASH_OPTSR2_PRG_SRAM2_ECC      (1 << 6)
#define FLASH_OPTSR2_PRG_USBPD_DIS      (1 << 8)

#define FLASH_OPTSR2_PRG_TZEN_SHIFT     (24)
#define FLASH_OPTSR2_PRG_TZEN_MASK      (0xff << FLASH_OPTSR2_PRG_TZEN_SHIFT)
#define FLASH_OPTSR2_PRG_TZEN_EN        (0xb4 << FLASH_OPTSR2_PRG_TZEN_SHIFT)
#define FLASH_OPTSR2_PRG_TZEN_DIS       (0xc3 << FLASH_OPTSR2_PRG_TZEN_SHIFT)

/* Flash Non-Secure Boot (Current) Register (NSBOOTR_CUR) */

#define FLASH_NSBOOTR_CUR_NSBOOT_LOCK_SHIFT  (0)
#define FLASH_NSBOOTR_CUR_NSBOOT_LOCK_MASK   (0xff << FLASH_NSBOOTR_CUR_NSBOOT_LOCK_SHIFT)
#define FLASH_NSBOOTR_CUR_NSBOOT_LOCK_MOD    (0xc3 << FLASH_NSBOOTR_CUR_NSBOOT_LOCK_SHIFT)
#define FLASH_NSBOOTR_CUR_NSBOOT_LOCK_FRZN   (0xb4 << FLASH_NSBOOTR_CUR_NSBOOT_LOCK_SHIFT)

#define FLASH_NSBOOTR_CUR_NSBOOTADD_SHIFT  (8)
#define FLASH_NSBOOTR_CUR_NSBOOTADD_MASK   (0xffffff << FLASH_NSBOOTR_CUR_NSBOOTADD_SHIFT)

/* Flash Non-Secure Boot (Program) Register (NSBOOTR_PRG) */

#define FLASH_NSBOOTR_PRG_NSBOOT_LOCK_SHIFT  (0)
#define FLASH_NSBOOTR_PRG_NSBOOT_LOCK_MASK   (0xff << FLASH_NSBOOTR_PRG_NSBOOT_LOCK_SHIFT)
#define FLASH_NSBOOTR_PRG_NSBOOT_LOCK_MOD    (0xc3 << FLASH_NSBOOTR_PRG_NSBOOT_LOCK_SHIFT)
#define FLASH_NSBOOTR_PRG_NSBOOT_LOCK_FRZN   (0xb4 << FLASH_NSBOOTR_PRG_NSBOOT_LOCK_SHIFT)

#define FLASH_NSBOOTR_PRG_NSBOOTADD_SHIFT  (8)
#define FLASH_NSBOOTR_PRG_NSBOOTADD_MASK   (0xffffff << FLASH_NSBOOTR_PRG_NSBOOTADD_SHIFT)

/* Flash Secure Boot (Current) Register (SECBOOTR_CUR) */

#define FLASH_SECBOOTR_CUR_SECBOOT_LOCK_SHIFT  (0)
#define FLASH_SECBOOTR_CUR_SECBOOT_LOCK_MASK   (0xff << FLASH_SECBOOTR_CUR_SECBOOT_LOCK_SHIFT)
#define FLASH_SECBOOTR_CUR_SECBOOT_LOCK_MOD    (0xc3 << FLASH_SECBOOTR_CUR_SECBOOT_LOCK_SHIFT)
#define FLASH_SECBOOTR_CUR_SECBOOT_LOCK_FRZN   (0xb4 << FLASH_SECBOOTR_CUR_SECBOOT_LOCK_SHIFT)

#define FLASH_SECBOOTR_CUR_SECBOOTADD_SHIFT  (8)
#define FLASH_SECBOOTR_CUR_SECBOOTADD_MASK   (0xffffff << FLASH_SECBOOTR_CUR_SECBOOTADD_SHIFT)

/* Flash Secure Boot Register (BOOTR_PRG) */

#define FLASH_BOOTR_PRG_SECBOOT_LOCK_SHIFT  (0)
#define FLASH_BOOTR_PRG_SECBOOT_LOCK_MASK   (0xff << FLASH_BOOTR_PRG_SECBOOT_LOCK_SHIFT)
#define FLASH_BOOTR_PRG_SECBOOT_LOCK_MOD    (0xc3 << FLASH_BOOTR_PRG_SECBOOT_LOCK_SHIFT)
#define FLASH_BOOTR_PRG_SECBOOT_LOCK_FRZN   (0xb4 << FLASH_BOOTR_PRG_SECBOOT_LOCK_SHIFT)

#define FLASH_BOOTR_PRG_SECBOOTADD_SHIFT    (8)
#define FLASH_BOOTR_PRG_SECBOOTADD_MASK     (0xffffff << FLASH_BOOTR_PRG_SECBOOTADD_SHIFT)

/* Flash Security Watermark for Bank1 (Current) Register (SECWM1R_CUR) */

#define FLASH_SECWM1R_CUR_SECWM1_STRT_SHIFT  (0)
#define FLASH_SECWM1R_CUR_SECWM1_END_SHIFT   (16)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_SECWM1R_CUR_SECWM1_STRT_MASK  (0x7f << FLASH_SECWM1R_CUR_SECWM1_STRT_SHIFT)
#  define FLASH_SECWM1R_CUR_SECWM1_END_MASK   (0x7f << FLASH_SECWM1R_CUR_SECWM1_END_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_SECWM1R_CUR_SECWM1_STRT_MASK  (0x1f << FLASH_SECWM1R_CUR_SECWM1_STRT_SHIFT)
#  define FLASH_SECWM1R_CUR_SECWM1_END_MASK   (0x1f << FLASH_SECWM1R_CUR_SECWM1_END_SHIFT)
#endif

/* Flash Security Watermark for Bank1 (Program) Register (SECWM1R_PRG) */

#define FLASH_SECWM1R_PRG_SECWM1_STRT_SHIFT  (0)
#define FLASH_SECWM1R_PRG_SECWM1_END_SHIFT   (16)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_SECWM1R_PRG_SECWM1_STRT_MASK  (0x7f << FLASH_SECWM1R_PRG_SECWM1_STRT_SHIFT)
#  define FLASH_SECWM1R_PRG_SECWM1_END_MASK   (0x7f << FLASH_SECWM1R_PRG_SECWM1_END_SHIFT)
#endif

