apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_flash.h
#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_SECWM1R_PRG_SECWM1_STRT_MASK  (0x1f << FLASH_SECWM1R_PRG_SECWM1_STRT_SHIFT)
#  define FLASH_SECWM1R_PRG_SECWM1_END_MASK   (0x1f << FLASH_SECWM1R_PRG_SECWM1_END_SHIFT)
#endif

/* Flash Data Sector Configuration Bank 1 (Current) Register (EDATA1R_CUR) */

#define FLASH_EDATA1R_CUR_EDATA1_STRT_SHIFT  (0)
#define FLASH_EDATA1R_CUR_EDATA1_STRT_MASK   (3 << FLASH_EDATA1R_CUR_EDATA1_STRT_SHIFT)
#define FLASH_EDATA1R_CUR_EDATA1_STRT(n)     ((n-1) << FLASH_EDATA1R_CUR_EDATA1_STRT_SHIFT) /* n = 1..8 */

#define FLASH_EDATA1R_CUR_EDATA1_EN          (1 << 15)

/* Flash Data Sector Configuration Bank 1 (Program) Register (EDATA1R_PRG) */

#define FLASH_EDATA1R_PRG_EDATA1_STRT_SHIFT  (0)
#define FLASH_EDATA1R_PRG_EDATA1_STRT_MASK   (3 << FLASH_EDATA1R_PRG_EDATA1_STRT_SHIFT)
#define FLASH_EDATA1R_PRG_EDATA1_STRT(n)     ((n-1) << FLASH_EDATA1R_PRG_EDATA1_STRT_SHIFT) /* n = 1..8 */

#define FLASH_EDATA1R_PRG_EDATA1_EN          (1 << 15)

/* Flash HDP Bank 1 Configuration (Current) Register (HDP1R_CUR) */

#define FLASH_HDP1R_CUR_HDP1_STRT_SHIFT  (0)
#define FLASH_HDP1R_CUR_HDP1_END_SHIFT   (0)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_HDP1R_CUR_HDP1_STRT_MASK  (0x7f << FLASH_HDP1R_PRG_HDP1_STRT_SHIFT)
#  define FLASH_HDP1R_CUR_HDP1_END_MASK   (0x7f << FLASH_HDP1R_PRG_HDP1_END_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_HDP1R_CUR_HDP1_STRT_MASK  (0x1f << FLASH_HDP1R_PRG_HDP1_STRT_SHIFT)
#  define FLASH_HDP1R_CUR_HDP1_END_MASK   (0x1f << FLASH_HDP1R_PRG_HDP1_END_SHIFT)
#endif

/* Flash HDP Bank 1 Configuration (Program) Register (HDP1R_PRG) */

#define FLASH_HDP1R_PRG_HDP1_STRT_SHIFT  (0)
#define FLASH_HDP1R_PRG_HDP1_END_SHIFT   (0)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_HDP1R_PRG_HDP1_STRT_MASK  (0x7f << FLASH_HDP1R_PRG_HDP1_STRT_SHIFT)
#  define FLASH_HDP1R_PRG_HDP1_END_MASK   (0x7f << FLASH_HDP1R_PRG_HDP1_END_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_HDP1R_PRG_HDP1_STRT_MASK  (0x1f << FLASH_HDP1R_PRG_HDP1_STRT_SHIFT)
#  define FLASH_HDP1R_PRG_HDP1_END_MASK   (0x1f << FLASH_HDP1R_PRG_HDP1_END_SHIFT)
#endif

/* Flash ECC Correction Register (ECCCORR) */

#define FLASH_ECCCORR_ADDR_ECC_SHIFT  (0)
#define FLASH_ECCCORR_ADDR_ECC_MASK   (0xffff << FLASH_ECCCORR_ADDR_ECC_SHIFT)

#define FLASH_ECCCORR_OBK_ECC    (1 << 20)
#define FLASH_ECCCORR_EDATA_ECC  (1 << 21)
#define FLASH_ECCCORR_BK_ECC     (1 << 22)
#define FLASH_ECCCORR_SYSF_ECC   (1 << 23)
#define FLASH_ECCCORR_OTP_ECC    (1 << 24)
#define FLASH_ECCCORR_ECCCIE     (1 << 25)
#define FLASH_ECCCORR_ECCC       (1 << 30)

/* Flash ECC Detection Register (ECCDETR) */

#define FLASH_ECCDETR_ADDR_ECC_SHIFT  (0)
#define FLASH_ECCDETR_ADDR_ECC_MASK   (0xffff << FLASH_ECCDETR_ADDR_ECC_SHIFT)

#define FLASH_ECCDETR_OBK_ECC    (1 << 20)
#define FLASH_ECCDETR_EDATA_ECC  (1 << 21)
#define FLASH_ECCDETR_BK_ECC     (1 << 22)
#define FLASH_ECCDETR_SYSF_ECC   (1 << 23)
#define FLASH_ECCDETR_OTP_ECC    (1 << 24)
#define FLASH_ECCDETR_ECCD       (1 << 31)

/* Flash ECC Data Register (ECCDR) */

#define FLASH_ECCDR_DATA_ECC_SHIFT  (0)
#define FLASH_ECCDR_DATA_ECC_MASK   (0xffff << FLASH_ECCDR_DATA_ECC_SHIFT)

/* Flash Security Watermark for Bank2 (Program) Register (SECWM2R_PRG) */

#define FLASH_SECWM2R_PRG_SECWM2_STRT_SHIFT  (0)
#define FLASH_SECWM2R_PRG_SECWM2_END_SHIFT   (16)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_SECWM2R_PRG_SECWM2_STRT_MASK  (0x7f << FLASH_SECWM2R_PRG_SECWM2_STRT_SHIFT)
#  define FLASH_SECWM2R_PRG_SECWM2_END_MASK   (0x7f << FLASH_SECWM2R_PRG_SECWM2_END_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_SECWM2R_PRG_SECWM2_STRT_MASK  (0x1f << FLASH_SECWM2R_PRG_SECWM2_STRT_SHIFT)
#  define FLASH_SECWM2R_PRG_SECWM2_END_MASK   (0x1f << FLASH_SECWM2R_PRG_SECWM2_END_SHIFT)
#endif

/* Flash Data Sector Configuration Bank 2 (Current) Register (EDATA2R_CUR) */

#define FLASH_EDATA2R_CUR_EDATA2_STRT_SHIFT  (0)
#define FLASH_EDATA2R_CUR_EDATA2_STRT_MASK   (3 << FLASH_EDATA2R_CUR_EDATA2_STRT_SHIFT)
#define FLASH_EDATA2R_CUR_EDATA2_STRT(n)     ((n-1) << FLASH_EDATA2R_CUR_EDATA2_STRT_SHIFT) /* n = 1..8 */

#define FLASH_EDATA2R_CUR_EDATA2_EN          (1 << 15)

/* Flash Data Sector Configuration Bank 2 (Program) Register (EDATA2R_PRG) */

#define FLASH_EDATA2R_PRG_EDATA2_STRT_SHIFT  (0)
#define FLASH_EDATA2R_PRG_EDATA2_STRT_MASK   (3 << FLASH_EDATA2R_PRG_EDATA2_STRT_SHIFT)
#define FLASH_EDATA2R_PRG_EDATA2_STRT(n)     ((n-1) << FLASH_EDATA2R_PRG_EDATA2_STRT_SHIFT) /* n = 1..8 */

#define FLASH_EDATA2R_PRG_EDATA2_EN          (1 << 15)

/* Flash HDP Bank 2 Configuration (Current) Register (HDP1R_CUR) */

#define FLASH_HDP2R_CUR_HDP2_STRT_SHIFT  (0)
#define FLASH_HDP2R_CUR_HDP2_END_SHIFT   (0)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_HDP2R_CUR_HDP2_STRT_MASK  (0x7f << FLASH_HDP2R_PRG_HDP2_STRT_SHIFT)
#  define FLASH_HDP2R_CUR_HDP2_END_MASK   (0x7f << FLASH_HDP2R_PRG_HDP2_END_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_HDP2R_CUR_HDP2_STRT_MASK  (0x1f << FLASH_HDP2R_PRG_HDP2_STRT_SHIFT)
#  define FLASH_HDP2R_CUR_HDP2_END_MASK   (0x1f << FLASH_HDP2R_PRG_HDP2_END_SHIFT)
#endif

/* Flash HDP Bank 2 Configuration (Program) Register (HDP2R_PRG) */

#define FLASH_HDP2R_PRG_HDP2_STRT_SHIFT  (0)
#define FLASH_HDP2R_PRG_HDP2_END_SHIFT   (0)

#if defined(CONFIG_STM32_STM32H56XXX) || defined(CONFIG_STM32_STM32H57XXX)
#  define FLASH_HDP2R_PRG_HDP2_STRT_MASK  (0x7f << FLASH_HDP2R_PRG_HDP2_STRT_SHIFT)
#  define FLASH_HDP2R_PRG_HDP2_END_MASK   (0x7f << FLASH_HDP2R_PRG_HDP2_END_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32H52XXX) || defined(CONFIG_STM32_STM32H53XXX)
#  define FLASH_HDP2R_PRG_HDP2_STRT_MASK  (0x1f << FLASH_HDP2R_PRG_HDP2_STRT_SHIFT)
#  define FLASH_HDP2R_PRG_HDP2_END_MASK   (0x1f << FLASH_HDP2R_PRG_HDP2_END_SHIFT)
#endif

#endif /* __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_FLASH_H */
